#include "pch.h"
#include "Component_Light.h"

//*---------------------------------------------------------------------------------------
//* @:Light Class 
//*【?】コンストラクタ
//* 引数：1.オーナー
//* 引数：2.更新レイヤー
//*----------------------------------------------------------------------------------------
Light::Light(std::weak_ptr<GameObject> pOwner, int updateRank) : IComponent(pOwner, updateRank),
m_Intensity(1.0f),
m_LightColor()
{

};


//*---------------------------------------------------------------------------------------
//* @:Light Class 
//*【?】カメラのトランスフォーム設定
//* 引数：1.std::weak_ptr<Camera> pCamTransform
//* 返値：void
//*----------------------------------------------------------------------------------------
void Light::set_CameraTransform(std::weak_ptr<class Transform> pCamTransform)
{
	m_pCameraTransform = pCamTransform;
}


//*---------------------------------------------------------------------------------------
//* @:Light Class 
//*【?】ライトカラーの設定
//* 引数：1.VECTOR3 カラー値
//* 返値：void
//*----------------------------------------------------------------------------------------
void Light::set_LightColor(const VECTOR3::VEC3 &col)
{
	m_LightColor = col;
}


//*---------------------------------------------------------------------------------------
//* @:Light Class 
//*【?】光の強さ設定
//* 引数：1.強度
//* 返値：void
//*----------------------------------------------------------------------------------------
void Light::set_Intensity(float ins)
{
	m_Intensity = ins;
}
