#include "pch.h"
#include "GameObject.h"

//*---------------------------------------------------------------------------------------
//* @:GameObject3D Class 
//*【?】コンストラクタ
//* 引数：なし
//*----------------------------------------------------------------------------------------
GameObject::GameObject()
{

}

//*---------------------------------------------------------------------------------------
//* @:GameObject3D Class 
//*【?】デストラクタ
//* 引数：なし
//*----------------------------------------------------------------------------------------
GameObject::~GameObject()
{

}


//*---------------------------------------------------------------------------------------
//* @:Object Class 
//*【?】コンポーネントの更新
//* 引数：なし
//* 戻値：void
//*----------------------------------------------------------------------------------------
void GameObject::ComponentUpdate(RendererManager& renderer)
{
	for (auto& comp : m_pComponentList)
	{
		comp.get()->Update(renderer);
	}
}


//*---------------------------------------------------------------------------------------
//* @:Object Class 
//*【?】コンポーネントの描画
//* 引数：なし
//* 戻値：void
//*----------------------------------------------------------------------------------------
void GameObject::ComponentRender(RendererManager& renderer)
{
	for (auto& comp : m_pComponentList)
	{
		comp.get()->Draw(renderer);
	}
}


//*---------------------------------------------------------------------------------------
//* @:Object Class 
//*【?】Transformの取得
//* 引数：なし
//* 戻値：弱参照ポインタ
//*----------------------------------------------------------------------------------------
std::weak_ptr<Transform> GameObject::get_Transform() const
{
	return m_pTransform;
}
