#include "pch.h"
#include "IComponent.h"
#include "GameObject.h"


//*---------------------------------------------------------------------------------------
//* @:IComponent Class 
//*【?】コンストラクタ
//* 引数：なし
//*----------------------------------------------------------------------------------------
IComponent::IComponent(std::weak_ptr<GameObject> pOwner, int updateRank ):
    m_pOwner(pOwner),
    m_UpdateRank(updateRank)
{

}


//*---------------------------------------------------------------------------------------
//* @:IComponent Class 
//*【?】デストラクタ
//* 引数：なし
//*----------------------------------------------------------------------------------------
IComponent::~IComponent()
{

}







