#include "pch.h"
#include "ObjectSelect.h"
#include "RendererEngine.h"
#include "GameObject.h"
#include "Component_Transform.h"

//*---------------------------------------------------------------------------------------
//*【?】コンストラクタ
//*----------------------------------------------------------------------------------------
ObjectSelect::ObjectSelect()
    : EditorBase()
{
}

//*---------------------------------------------------------------------------------------
//*【?】デストラクタ
//*----------------------------------------------------------------------------------------
ObjectSelect::~ObjectSelect()
{
}


//*---------------------------------------------------------------------------------------
//*【?】初期化
//*
//* [引数]
//* &renderer : 描画エンジンの参照
//*
//* [返値]
//* true : 成功
//* false : 失敗
//*----------------------------------------------------------------------------------------
bool ObjectSelect::Init(RendererEngine &renderer)
{
    return true;
}


//*---------------------------------------------------------------------------------------
//*【?】更新
//*
//* [引数]
//* &renderer : 描画エンジンの参照
//* pObj : 編集するオブジェクトのポインタ
//*
//* [返値]
//* true : 成功
//* false : 失敗
//*----------------------------------------------------------------------------------------
void ObjectSelect::OnEditorGUI(RendererEngine &renderer, GameObject &pObj)
{

}
