#pragma once
#include "GameObject.h"


// ***************************************************************************************
// ---------------------------------------------------------------------------------------
/* --- @:IDXBuffer Class --- */
//
//  ★継承：GameObject3D ← MyTransform ← Object ★
//
// 【?】バッファを格納するクラス
//		GameObject3Dがこのクラスを継承する形でもいいかもしれない
//		寧ろObjectクラスの次にこれが来てもいいかも？
//
// ***************************************************************************************
class IDXBuffer : public GameObject
{
private:



public:
	IDXBuffer();
	virtual ~IDXBuffer() = default;

};

