#pragma once


// ***************************************************************************************
// ---------------------------------------------------------------------------------------
/* --- @:EventCondition Class --- */
//
//  ★★★抽象クラス★★★
//
// 【?】イベントを実行する際の、条件を定義するクラス
//		派生クラスで条件を定義して、イベントの実行可否を判定する
//
// ***************************************************************************************
class EventCondition
{
public:
    virtual ~EventCondition() = default;

    virtual bool IsSatisfied() = 0;
};

