#pragma once
#include "GameObject.h"


// ***************************************************************************************
// ---------------------------------------------------------------------------------------
/* --- @:IDXBuffer Class --- */
//
// 【?】バッファを格納するクラス
//		GameObject3Dがこのクラスを継承する形でもいいかもしれない
//		寧ろObjectクラスの次にこれが来てもいいかも？
//
// ***************************************************************************************
class IDXBuffer
{
private:

public:
	IDXBuffer();
	virtual ~IDXBuffer() = default;

};

