/* ◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇
// 
/* - @:デバッグ関数ヘッダ - */
//
//  【?】デバッグに使えそうな関数をまとめているよ
//       大体がfloat4を出力、つまり引数として受け取った値から
//       ピクセルの色を出力しているよ
//       例えば座標を入れたらその座標からそのピクセルの色はこうだ！っていう風に
//       加工して出力するよ
//
/* ◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇ */
#ifndef DEBUGFUNCTIONS_HLSLI
#define DEBUGFUNCTIONS_HLSLI

//*---------------------------------------------------------------------------------------
//*【?】法線デバッグ
//* 引数：1.法線
//* 返値：float4
//*----------------------------------------------------------------------------------------
float4 Debug_Norm(float4 norm)
{
    float4 debugNorm = float4((norm));
    return debugNorm;
}


//*---------------------------------------------------------------------------------------
//*【?】座標デバッグ（絶対値化）
//* 引数：1.座標（ワールドでもなんでも）
//* 返値：float4
//*----------------------------------------------------------------------------------------
float4 Debug_Pos(float4 pos)
{
    float4 resCol = float4(0, 0, 0, 0);
    resCol = normalize(pos);
    return abs(resCol);
}


//*---------------------------------------------------------------------------------------
//*【?】ワールド座標をライトを反映させてデバッグ（絶対値化）
//* 引数：1.ワールド座標
//* 引数：2.ディフューズ
//* 引数：3.スペキュラ
//* 引数：4.アンビエント
//* 返値：float4
//*----------------------------------------------------------------------------------------
float4 Debug_Pos_AffectsLight(float4 wPos, float3 diff, float3 spc, float amb)
{
    float4 resCol = float4(0, 0, 0, 1);
    resCol = normalize(wPos);
    
    // ライトの反映
    resCol.xyz *= (diff + amb) + spc;
    
    return abs(resCol);
}

//*---------------------------------------------------------------------------------------
//*【?】深度値デバッグ
//* 引数：1.深度値
//* 返値：float4
//*----------------------------------------------------------------------------------------
float4 Debug_Depth(float dph)
{
    if (dph >= 1.0)
        return float4(0, 0, 0, 1);
    else if (dph > 0.8)
        return float4(0, 1, 0, 1);
    else if (dph > 0.6)
        return float4(0, 0, 1, 1);
    else if (dph > 0.4)
        return float4(1, 1, 0, 1);
    else if (dph > 0.2)
        return float4(0, 1, 1, 1);
    else
        return float4(1, 0, 1, 1);
}
//*---------------------------------------------------------------------------------------
//*【?】深度値デバッグ（グレースケール）
//* 引数：1.深度値
//* 返値：float4
//*----------------------------------------------------------------------------------------
float4 Debug_DepthGray(float dph)
{
    return float4(dph, dph, dph, 1.0);
}

#endif 