// \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//
/* - @:頂点シェーダ -*/
//
//  【?】スカイボックス用
//
// \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#pragma once
#include "ConstantBuffers_H.hlsli"

/* =========================================================================
/* - @:入力構造体 - */
/*  Pos以外使わない
/* =========================================================================*/
struct VS_IN
{
    float3 Pos      : POSITION;
    float2 UV       : TEXCOORD;
    float4 Color    : COLOR;
    float3 Normal   : NORMAL;
};

/* =========================================================================
/* - @:入力構造体 - */
/* =========================================================================*/
struct VS_OUT
{
    float4 Pos : SV_POSITION;
    float3 TexCoord : TEXCOORD;
};


// **************************************************************************
/* - @:エントリーポイント - */
// **************************************************************************
VS_OUT VSMain(VS_IN input)
{
    float4 pos = float4(input.Pos, 1.0f);
    VS_OUT output;
    
    // cpp側で平行移動成分を除いた行列をワールド行列に対して掛けているので、
    // ここでビュー変換はしない
    pos = mul(pos,cb_Transform);
    pos = mul(pos, cb_Projection);
    

    pos.z = pos.w;
    
    output.Pos = pos;               // 画面空間
    output.TexCoord = input.Pos;    // これをテクスチャのサンプリングに使う（頂点位置そのまま）
    
    return output;
}