// \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//
/* - @:頂点シェーダ -*/
//
//  【?】スプライト用頂点シェーダ
//
// \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#pragma once;
#include "UtilityHeader.hlsli"

Texture2D g_Texture : register(t0);

/* =========================================================================
/* - @:入力構造体 - */
/* =========================================================================*/
struct VS_INPUT
{
    float3 Pos      : POSITION; // 頂点座標
    float3 Normal   : NORMAL;   // 法線（cpp側の都合で入れているが基本使わない）
    float4 Color    : COLOR;    // 頂点色
    float2 UV       : TEXCOORD; // テクスチャ座標
};
/* =========================================================================
/* - @:出力構造体 - */
/* =========================================================================*/
struct VS_OUT
{
    float4 Pos   : SV_POSITION;
    float4 Color : COLOR;
    float2 UV    : TEXCOORD;
};

// **************************************************************************
/* - @:エントリーポイント - */
// **************************************************************************
VS_OUT VSMain(VS_INPUT input) 
{
    VS_OUT output;
    float4 pos = float4(input.Pos, 1.0f);
    float2 uv = input.UV;
    float4 color = input.Color;
    
    //pos = mul(pos, Transform); // ワールド変換
    //pos = mul(pos, View); // ビュー変換
    //pos = mul(pos, Projection); // 投影変換
    
    output.Pos   = pos;
    output.Color = color;
    output.UV    = uv;
    return output;
}